void main() {
  /*
  int днейДоПенсии = 13278;

  do{
  
    if(!выходной){
     if(проснулсяВовремя) {
      охотаСпать ? переставитьБудильник(5) : потискатьСобаку();
      завтрак();
     }
     умытья();
     одеться();
     ехатьНаРаботу();
    }
    
    днейДоПенсии--;
  } 
  while( днейДоПенсии == 0 );
  
}

void завтрак(){
  switch(продукты){
    case фрукты && каша:
      кашаСфруктами();
      break;
     case тортик:
      тортикСчаем();
      break;
     default:
      чайСбутером();
  }
}

void одеться() {
  if(событие) {
    нарядиться();
  } else {
    обычнаяОдежда();
  }
}

int переставитьБудильник(int минуты) {
  return часы.toМинуты() - минуты;
}
*/
}
